org/20220622092525-the_reasoned_schemer_in_racket.org
:PROPERTIES:
:ID:       4e104b5d-8421-4cdd-94c9-12da63392b54
:END:
#+TITLE: The Reasoned Schemer in Racket
#+CREATED: [2022-06-22 Wed 09:25]
#+LAST_MODIFIED: [2022-06-22 Wed 09:28]

I have decided to learn Racket with Relational Programming as an excuse. To run /The Reasoned Schemer/'s examples you need to use an implementation of /minikanren/ in Racket. There is a /minikanren/ package available in raco, but it departs from the book's syntax too much for my taste. I prefer to install the canonical implementation in the following way:

#+begin_src bash
raco pkg install github://github.com/miniKanren/Racket-miniKanren/master
#+end_src

Which you can then use by calling

#+begin_src racket
(require "Racket-miniKanren/miniKanren/mk")
#+end_src

in the header.
