20220622092525-the_reasoned_schemer_in_racket.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2024-01-01 Mon 16:44 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>The Reasoned Schemer in Racket</title>
<meta name="author" content="Rémi Louf" />
<meta name="generator" content="Org Mode" />
<link rel="stylesheet" type="text/css" href="style.css" /></head>
<body>
<div id="content" class="content">
<h1 class="title">The Reasoned Schemer in Racket</h1>
<p>
I have decided to learn Racket with Relational Programming as an excuse. To run <i>The Reasoned Schemer</i>'s examples you need to use an implementation of <i>minikanren</i> in Racket. There is a <i>minikanren</i> package available in raco, but it departs from the book's syntax too much for my taste. I prefer to install the canonical implementation in the following way:
</p>

<div class="org-src-container">
<pre class="src src-bash">raco pkg install github://github.com/miniKanren/Racket-miniKanren/master
</pre>
</div>

<p>
Which you can then use by calling
</p>

<div class="org-src-container">
<pre class="src src-racket">(require "Racket-miniKanren/miniKanren/mk")
</pre>
</div>

<p>
in the header.
</p>

<div id="outline-container-orga921fa5" class="outline-2">
<h2 id="orga921fa5">Links to this note</h2>
</div>
</div>
</body>
</html>
